src/Catalogs/фуСтруктураОтчётаОПУ/фуСтруктураОтчётаОПУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>фуСтруктураОтчётаОПУ</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>КодСтрокиВОтчете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУдалятьСтрокуУровняВОтчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.фуСтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГруппаЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньВложенности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/фуСтруктураОтчётаОПУ/ManagerModule.bsl
#Область о //Обновление ИБ:                

Процедура ПервоночальноеЗаполнениеСправочника_1_0_1_15() Экспорт
	
	Отказ = Ложь;
	ЗаголовкиСправочникаСоответствие = Новый Соответствие;
	
	// Операционная прибыль:
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Операционная прибыль");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","6000");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);	
	
	// Чистая прибыль:
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Чистая прибыль");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","9000");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	ЗаголовкиСправочникаСоответствие.Вставить("Чистая прибыль",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));
	
	// Рентабельность по чистой прибыли: 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Рентабельность по чистой прибыли");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","9001");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Чистая прибыль"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	// EBITDA:
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","EBITDA");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","10000");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	ЗаголовкиСправочникаСоответствие.Вставить("EBITDA",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));
	
	// Рентабельность по EBITDA: 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Рентабельность по EBITDA");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","10001");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["EBITDA"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
КонецПроцедуры

Процедура ПерезаписатьДанныеСправочников_1_0_1_14() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	фуСтруктураОтчётаОПУ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.фуСтруктураОтчётаОПУ КАК фуСтруктураОтчётаОПУ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры    

Процедура ПервоночальноеЗаполнениеСправочника_1_0_1_11() Экспорт
	
	Отказ = Ложь;
	ЗаголовкиСправочникаСоответствие = Новый Соответствие;
	
	// Операционные доходы:
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Операционные доходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","1000");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	ЗаголовкиСправочникаСоответствие.Вставить("Операционные доходы",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));

	//Продажи RollerAds: 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Продажи RollerAds");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","1010");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Продажи RollerAds"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Операционные доходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//Продажи Арбитраж:     
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Продажи Арбитраж");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","1020");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Продажи Арбитраж"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Операционные доходы"]);
    СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//Прочие поступления:
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие поступления");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","1030");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие поступления"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Операционные доходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//2000	Прямые затраты         
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прямые затраты");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2000");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	ЗаголовкиСправочникаСоответствие.Вставить("Прямые затраты",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));

	//2010	Выплаты паблишерам (RA)_SP 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Выплаты паблишерам (RA)_SP");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2010");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Выплаты паблишерам (RA)_SP"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Прямые затраты"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//2020	Выплаты паблишерам (RA)_Direct
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Выплаты паблишерам (RA)_Direct");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2020");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Выплаты паблишерам (RA)_Direct"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Прямые затраты"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//2030	Закупка трафика в сетках (RA)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Закупка трафика в сетках (RA)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2030");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Закупка трафика в сетках (RA)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Прямые затраты"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//2040	Referral payment
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Referral payment");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2040");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Referral payment"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Прямые затраты"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//2050	Refund
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Refund");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2050");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Refund"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Прямые затраты"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//2060	Закупка трафика (Арб)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Закупка трафика (Арб)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2060");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Закупка трафика (Арб)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Прямые затраты"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//2070	Прочие прямые затраты
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие прямые затраты");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","2070");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие прямые затраты"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Прямые затраты"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//3000	Маржинальный доход 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Маржинальный доход");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","3000");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	ЗаголовкиСправочникаСоответствие.Вставить("Маржинальный доход",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));

	//3010	Рентабельность по маржинальному доходу
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Рентабельность по маржинальному доходу");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","3010");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Рентабельность по маржинальному доходу"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маржинальный доход"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);	
	
	//4000	Операционные расходы   
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Операционные расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","4000");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",Неопределено);
	ЗаголовкиСправочникаСоответствие.Вставить("Операционные расходы",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));
	
	//4100	Оплата труда персонала                                 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Оплата труда персонала");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","4100");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Операционные расходы"]);
	ЗаголовкиСправочникаСоответствие.Вставить("Оплата труда персонала",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));	
	
	//4110	  Основная заработная плата 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Основная заработная плата");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","4110");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Основная заработная плата"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Оплата труда персонала"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//4120	  Премии, бонусы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Премии, бонусы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","4120");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Премии, бонусы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Оплата труда персонала"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//4130	  Оплата привлечённого персонала   
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Оплата привлечённого персонала");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","4130");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Оплата привлечённого персонала"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Оплата труда персонала"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//4140	  Прочие затраты на оплату труда
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие затраты на оплату труда");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","4140");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие затраты на оплату труда"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Оплата труда персонала"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5200	Налоговые расходы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Налоговые расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5200");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",Неопределено);
	ЗаголовкиСправочникаСоответствие.Вставить("Налоговые расходы",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));
	
	//5210	  Налоги на фонд оплаты труда   
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Налоги на фонд оплаты труда");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5210");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Налоги на фонд оплаты труда"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Налоговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5230	  Налог на прибыль 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Налог на прибыль");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5230");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Налог на прибыль"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Налоговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5240	  Прочие налоги и сборы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие налоги и сборы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5240");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие налоги и сборы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Налоговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5300	  Маркетинговые расходы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Маркетинговые расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5300");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",Неопределено);
	ЗаголовкиСправочникаСоответствие.Вставить("Маркетинговые расходы",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));
	
	//5310	  Участие в выставках и др. мероприятиях
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Участие в выставках и др. мероприятиях");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5310");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Участие в выставках и др. мероприятиях"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5320	  Собственные мероприятия
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Собственные мероприятия");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5320");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Собственные мероприятия"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5320	  Вознаграждение за лиды (клиенты)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Вознаграждение за лиды (клиенты)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5320");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Вознаграждение за лиды (клиенты)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5320	  Вознаграждение за лиды (паблишеры)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Вознаграждение за лиды (паблишеры)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5320");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Вознаграждение за лиды (паблишеры)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5330	  Сувениры, подарки
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Сувениры, подарки");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5330");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Сувениры, подарки"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5340	  Расходы на рекламу (таргетированная реклама)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Расходы на рекламу (таргетированная реклама)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5340");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Расходы на рекламу (таргетированная реклама)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5340	  Расходы на рекламу (прочая реклама)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Расходы на рекламу (прочая реклама)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5340");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Расходы на рекламу (прочая реклама)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5340	  Расходы на PR
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Расходы на PR");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5340");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Расходы на PR"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5350	  Полиграфия и материалы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Полиграфия и материалы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5350");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Полиграфия и материалы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5360	  Командировки (маркетинг)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Командировки (маркетинг)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5360");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Командировки (маркетинг)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5380	  Дизайн
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Дизайн");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5380");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Дизайн"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5390	  Консультационные услуги
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Консультационные услуги");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5390");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Консультационные услуги"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5391	  Контент Маркетинг
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Контент Маркетинг");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5391");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Контент Маркетинг"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5392	  Членские взносы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Членские взносы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5392");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Членские взносы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5393	  Прочие расходы на маркетинг
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие расходы на маркетинг");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5393");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие расходы на маркетинг"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Маркетинговые расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5400	Производственные расходы 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Производственные расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5400");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",Неопределено);
	ЗаголовкиСправочникаСоответствие.Вставить("Производственные расходы",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));
	
	//5410	  Хостинг серверов и телематические услуги  
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Хостинг серверов и телематические услуги");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5410");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Хостинг серверов и телематические услуги"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5420	  Домены и обслуживание сайтов              
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Домены и обслуживание сайтов");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5420");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Домены и обслуживание сайтов"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);  
	
	//5430	  Интернет на площадке                      
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Интернет на площадке");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5430");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Интернет на площадке"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);  
	
	//5440	  Комплектующие и мелкий upgrade            
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Комплектующие и мелкий upgrade");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5440");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Комплектующие и мелкий upgrade"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);  
	
	//5450	  Ремонт техники                            
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Ремонт техники");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5450");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Ремонт техники"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5460	  Банковские и расчётные услуги             
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Банковские и расчётные услуги");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5460");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	ЗаголовкиСправочникаСоответствие.Вставить("Банковские и расчётные услуги",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));
	
	//5461	      Конвертация и трансфер    
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Конвертация и трансфер");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5461");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Конвертация и трансфер"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Банковские и расчётные услуги"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5461	      Комиссия ПС (клиенты)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Комиссия ПС (клиенты)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5461");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Комиссия ПС (клиенты)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Банковские и расчётные услуги"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5461	      Комиссия ПС (площадки)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Комиссия ПС (площадки)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5461");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Комиссия ПС (площадки)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Банковские и расчётные услуги"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5462	      РКО и прочие услуги банка
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","РКО и прочие услуги банка");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5462");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","РКО и прочие услуги банка"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Банковские и расчётные услуги"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5463	      Проценты по кредитам
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Проценты по кредитам");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5463");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Проценты по кредитам"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Банковские и расчётные услуги"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5470	  Обслуживание технических компаний
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Обслуживание технических компаний");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5470");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Обслуживание технических компаний"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5480	  Затраты на SaaS (облачное ПО)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Затраты на SaaS (облачное ПО)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5480");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Затраты на SaaS (облачное ПО)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5490	  Затраты на серверное оборудование и ПО
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Затраты на серверное оборудование и ПО");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5490");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Затраты на серверное оборудование и ПО"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5490	  Затраты на офисное оборудование и ПО
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Затраты на офисное оборудование и ПО");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5490");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Затраты на офисное оборудование и ПО"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5495	  Затраты на разработку ПО
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Затраты на разработку ПО");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5495");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Затраты на разработку ПО"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5499	  Прочие производственные расходы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие производственные расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5499");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие производственные расходы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Производственные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5500	Административные расходы    
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Административные расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5500");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",Неопределено);
	ЗаголовкиСправочникаСоответствие.Вставить("Административные расходы",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));	
	
	//5510	  Аренда офиса
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Аренда офиса");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5510");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Аренда офиса"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5520	  Обслуживание и ремонт офиса
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Обслуживание и ремонт офиса");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5520");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Обслуживание и ремонт офиса"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
  	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5530	  Мебель для офиса
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Мебель для офиса");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5530");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Мебель для офиса"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
    СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5540	  Услуги связи  
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Услуги связи");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5540");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",Неопределено);
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Истина);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	ЗаголовкиСправочникаСоответствие.Вставить("Услуги связи",СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ));	

	//5541	     Интернет в офисе 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Интернет в офисе");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5541");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Интернет в офисе"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Услуги связи"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5542	     Телефония
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Телефония");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5542");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Телефония"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Услуги связи"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5549	     Прочие услуги связи
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие услуги связи");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5549");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие услуги связи"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Услуги связи"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5550	  Почтовые и курьерские услуги   
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Почтовые и курьерские услуги");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5550");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Почтовые и курьерские услуги"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);
	
	//5555	  Затраты на подбор персонала
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Затраты на подбор персонала");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5555");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Затраты на подбор персонала"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5560	  Юридические и информационные услуги
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Юридические и информационные услуги");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5560");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Юридические и информационные услуги"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5570	  Питание в офисе
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Питание в офисе");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5570");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Питание в офисе"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5580	  Командировки (прочие)
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Командировки (прочие)");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5580");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Командировки (прочие)"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5590	  Канцелярия, хозрасходы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Канцелярия, хозрасходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5590");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Канцелярия, хозрасходы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5591	  Транспорт и сотовая связь сотрудников
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Транспорт и сотовая связь сотрудников");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5591");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Транспорт и сотовая связь сотрудников"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5592	  Обучение, литература, периодика
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Обучение, литература, периодика");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5592");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Обучение, литература, периодика"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5593	  Отдых и прочие расходы на персонал
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Отдых и прочие расходы на персонал");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5593");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Отдых и прочие расходы на персонал"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5594	Прочие операционные расходы 
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие операционные расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5594");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие операционные расходы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	//5599	Прочие инвестиционные расходы
	СтруктураЗаполнения	= Новый Структура;
	СтруктураЗаполнения.Вставить("Наименование","Прочие инвестиционные расходы");
	СтруктураЗаполнения.Вставить("КодСтрокиВОтчете","5599");
	СтруктураЗаполнения.Вставить("СтатьяЗатрат",фуОбщийСервер.ПолучитьСправочникПоНаименованию("фуСтатьиЗатрат","Прочие инвестиционные расходы"));
	СтруктураЗаполнения.Вставить("ЭтоГруппаЗаголовок",Ложь);
	СтруктураЗаполнения.Вставить("Родитель",ЗаголовкиСправочникаСоответствие["Административные расходы"]);
	СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ);

	
КонецПроцедуры    

Функция СоздатьЭлементСправочникаОПУ(СтруктураЗаполнения,Отказ)
	
	СправочникСсылка = Справочники.фуСтруктураОтчётаОПУ.ПустаяСсылка();
	
	Если Отказ Тогда
		Возврат СправочникСсылка;		
	КонецЕсли;
	
	СправочникСсылка = Справочники.фуСтруктураОтчётаОПУ.НайтиПоНаименованию(СтруктураЗаполнения.Наименование);
	Если ЗначениеЗаполнено(СправочникСсылка) Тогда
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	Иначе
		СправочникОбъект = Справочники.фуСтруктураОтчётаОПУ.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СправочникОбъект,СтруктураЗаполнения);
	СправочникОбъект.НеУдалятьСтрокуУровняВОтчете = Истина;
    
	Попытка
		СправочникОбъект.Записать();	
		СправочникСсылка = СправочникОбъект.Ссылка;	
	Исключение  
		Отказ = Истина;
		СправочникСсылка = Справочники.фуСтруктураОтчётаОПУ.ПустаяСсылка();
	    Сообщить("Ошибка при записи справочника. Описание: "+ОписаниеОшибки());
	КонецПопытки;
	
	Возврат СправочникСсылка;
		
КонецФункции

#КонецОбласти

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    
    //Начало Чесноков М.С. 2020-11-09 F1-16 
    //фуИностранныеЯзыкиСервер.УстановитьПредставлениеПоЯзыкуПользователя(Данные, Представление, СтандартнаяОбработка);
    //Начало Чесноков М.С. 2020-11-09 F1-16 

КонецПроцедуры
